[{"idx":"0ee03814-812d-499e-9126-4f2a2d599d01","name":"My paper","NodeDescription":"///t&nbsp;///s&nbsp;<br>&nbsp;Step 1<span style=\"white-space:pre\">\t</span>Baseline dataset, including the following variables :&nbsp;<br><ul><li>Patient ID</li><li>Index date</li><li>Study end date</li><li>Date of birth•<span style=\"white-space:pre\">\t</span>Sex•<span style=\"white-space:pre\">\t</span>SES closet to the index date&nbsp;•<span style=\"white-space:pre\">\t</span>Baseline comorbidity from one-year prior to the index date:&nbsp;•<span style=\"white-space:pre\">\t</span>Presence of any of the eight conditions listed in Appendix II Table 4 (i.e. total of 8 variables)&nbsp;</li><li>Total comorbidity count</li></ul><div><div>&nbsp;<br></div><div><br></div></div><div><br></div><div>Step 2<span style=\"white-space:pre\">\t</span>Drug exposure by individual DMD and non-exposure period&nbsp;Create a dataset containing the following variables:</div><div><ul><li>Patient ID</li><li>Start_Interval: Start date of each DMD exposure/ non-exposure period. The first Start_Interval date for each patient is the index date</li><li>Stop_Interval: End date of each DMD exposure/ non-exposure period. The last Stop_Interval date for each patient is the study end date.&nbsp;</li><li>DMD_No_Ind: Exposure by individual DMD within each period (see Appendix II Table 3) or No exposure.&nbsp;For drug exposure calculations:</li><li>General rule: use the ‘days supply’ recorded in the prescription/dispensing database to calculate the time exposed to drug.</li><li>If multiple dispensations (i.e. same DINs or different DINs but same DMD) on the same day, the ‘days supply’ for each dispensation will be added up.&nbsp; Exceptions: alemtuzumab &amp; ocrelizumab.</li><li>Assume individuals cannot accrue DMD, nor can they be on &gt;1 DMD at the same time. i.e., once a subsequent DMD prescription is filled (e.g., on DD/MM/YYYY), then assume the previous DMD was stopped (on DD/MM/YYYY minus one day).</li><li>Gap &lt;90 days between the dispensations for the same DMD (note: all the beta-interferon products are considered as one DMD) will be considered as being exposed continuously to the same DMD.•<span style=\"white-space: pre;\">\t</span>Discontinuation is defined as no further dispensations for the same individual DMD lasting ≥ 90 days after the end of days supply.</li><li>This discontinuation date will be the last DMD prescription filled date + days of drug supplied + 30-day grace period.</li></ul></div><div><div>&nbsp;<br></div><div><br></div></div><div>Step 3<span style=\"white-space:pre\">\t</span>New comorbidities for the creation of time periods&nbsp;(a) Create a dataset containing new comorbidities developed between the index date and study end date. The dataset containing the following variables:</div><div><ul><li>Patient ID</li><li>Comorbidity start date&nbsp;</li><li>Individual comorbidity status (i.e. total of 8 variables)&nbsp;</li><li>New comorbidities dates (see remarks below: +1 day )</li></ul>Comorbidity start date is the date of the first ICD code for any specific comorbidity listed Appendix II Table 4.For all the new comorbidity dates: please add ONE DAY (i.e. first ICD code for diabetes was captured on 1-Jan-2014 + 1 day = 2-Jan-2014).&nbsp;&nbsp;Keep this ‘new comorbidities’ dataset to be used in Step 5.(b) Combine new comorbidity dates and DMD exposure period/non-exposure start dates into one column:•<span style=\"white-space: pre;\">\t</span>Using the file prepared in Step 2 :&nbsp;Keep the variables ‘Start_Interval’ (start date for each exposure and non-exposure period), ‘DMD_No_Ind’(the exposure status) and Patient ID;&nbsp;Drop the variable Stop_Interval for each exposure and non-exposure period as new Stop_Interval for each period will be generated in Step 5 below.<span style=\"white-space: pre;\">\t</span>Create a separate file using the ‘new comorbidities’ dataset.</div><div>Keep the variables Patient ID and ‘New comorbidities dates’: rename the variable name ‘New comorbidity dates’ to ‘Start_Interval’. Combine all the new comorbidity dates with the DMD exposure period/non-exposure dates into one column. Sort the data and remove any duplicate dates for the variable ‘Start_Interval’ (i.e. keep only one row of date if the dates of a new comorbidity and the start date of exposure or non-exposure occurred on the same date).&nbsp;</div><div><br>s///&nbsp;t///</div>"}]